; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v6 - type_2 ?v8 - type_1)
 	      (pred_3 ?v3 - object ?v8 - type_1)
	      (pred_1 ?v6 - type_2 ?v5 - type_3)
	      (pred_4 ?v6 - type_2 ?v3 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v2 ?v7 - type_1)
       :precondition (and  (pred_2 ?v6 ?v2))
       :effect (and  (pred_2 ?v6 ?v7)
		     (not (pred_2 ?v6 ?v2))))

   (:action op_1
       :parameters (?v6 - type_2 ?v4 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v1) (pred_2 ?v6 ?v1) (pred_1 ?v6 ?v5))
       :effect (and (pred_4 ?v6 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v1)) 
		    (not (pred_1 ?v6 ?v5))))

   (:action op_3
       :parameters (?v6 - type_2 ?v4 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v4 ?v5) (pred_2 ?v6 ?v1))
       :effect (and (pred_3 ?v4 ?v1)
		    (pred_1 ?v6 ?v5)
		    (not (pred_4 ?v6 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_05 - type_2
obj_09 obj_06 obj_07 obj_08 - type_3
obj_02 obj_13 obj_10 obj_01 - type_1
obj_03 obj_11 obj_04 - object)
(:init
(pred_2 obj_12 obj_10)
(pred_1 obj_12 obj_09)
(pred_1 obj_12 obj_06)
(pred_2 obj_05 obj_10)
(pred_1 obj_05 obj_07)
(pred_1 obj_05 obj_08)
(pred_3 obj_03 obj_02)
(pred_3 obj_11 obj_01)
(pred_3 obj_04 obj_13)
)
(:goal
(and
(pred_3 obj_03 obj_02)
(pred_3 obj_11 obj_13)
(pred_3 obj_04 obj_01)
)
)

(:constraints
  (always (not (pred_2 obj_12 obj_01)))
)
)

; plan
1. (op_2 obj_12 obj_10 obj_13)
   deleted: (pred_2 obj_12 obj_10)
   added: (pred_2 obj_12 obj_13)
   goals met: 1 of 3
2. (op_2 obj_05 obj_10 obj_13)
   deleted: (pred_2 obj_05 obj_10)
   added: (pred_2 obj_05 obj_13)
   goals met: 1 of 3
3. (op_1 obj_05 obj_04 obj_13 obj_08)
   deleted: (pred_3 obj_04 obj_13) (pred_1 obj_05 obj_08)
   added: (pred_4 obj_05 obj_04 obj_08)
   goals met: 1 of 3
4. (op_2 obj_05 obj_13 obj_01)
   deleted: (pred_2 obj_05 obj_13)
   added: (pred_2 obj_05 obj_01)
   goals met: 1 of 3
5. (op_3 obj_05 obj_04 obj_01 obj_08)
   deleted: (pred_4 obj_05 obj_04 obj_08)
   added: (pred_3 obj_04 obj_01) (pred_1 obj_05 obj_08)
   goals met: 2 of 3
6. (op_1 obj_05 obj_11 obj_01 obj_08)
   deleted: (pred_3 obj_11 obj_01) (pred_1 obj_05 obj_08)
   added: (pred_4 obj_05 obj_11 obj_08)
   goals met: 2 of 3
7. (op_2 obj_05 obj_01 obj_13)
   deleted: (pred_2 obj_05 obj_01)
   added: (pred_2 obj_05 obj_13)
   goals met: 2 of 3
8. (op_3 obj_05 obj_11 obj_13 obj_08)
   deleted: (pred_4 obj_05 obj_11 obj_08)
   added: (pred_3 obj_11 obj_13) (pred_1 obj_05 obj_08)
   goals met: 3 of 3
